{"uuid":"4385b60562b11470249367f4032d3bd0cbc28560","bioAsHtml":"<p>Yara Senger has been a tireless Java activist in Brazil for many years. She is a Java Champion and Director of SouJava and she is an alternate representative of the group on the JCP Executive Committee. Yara has led SouJava in many initiatives, from technical events to social activities. She is co-founder and director of Globalcode, which trains developers throughout Brazil and The Developer&#x27;s Conference besides several Hackathons and other events. In 2011, she was recipient of the Duke Choice&#x27;s Award, for the JHome embedded environment. Yara is also an active speaker, giving presentations in many countries, including JavaOne SF, JavaOne Latin Ameria, JavaOne India, Devoxx, JFokus, and and get recognized as JavaOne Rockstar Speaker.</p>\n","acceptedTalks":[{"talkType":"Conference","track":"Future<Devoxx>","links":[{"href":"http://cfp.devoxx.be/api/conferences/DV15/talks/EDW-7208","rel":"http://cfp.devoxx.be/api/profile/talk","title":"More details about this talk"},{"href":"http://cfp.devoxx.be/api/conferences/DV15/speakers/b147fd96d1c957e5e53535af793cf6286cc0777b","rel":"http://cfp.devoxx.be/api/profile/speaker","title":"Vinicius Senger"},{"href":"http://cfp.devoxx.be/api/conferences/DV15/speakers/4385b60562b11470249367f4032d3bd0cbc28560","rel":"http://cfp.devoxx.be/api/profile/speaker","title":"Yara Senger"}],"id":"EDW-7208","title":"Providing Eyes, Ears, and a Mouth to Your IoT Project"},{"talkType":"BOF (Bird of a Feather)","track":"Future<Devoxx>","links":[{"href":"http://cfp.devoxx.be/api/conferences/DV15/talks/FBD-0753","rel":"http://cfp.devoxx.be/api/profile/talk","title":"More details about this talk"},{"href":"http://cfp.devoxx.be/api/conferences/DV15/speakers/b147fd96d1c957e5e53535af793cf6286cc0777b","rel":"http://cfp.devoxx.be/api/profile/speaker","title":"Vinicius Senger"},{"href":"http://cfp.devoxx.be/api/conferences/DV15/speakers/4385b60562b11470249367f4032d3bd0cbc28560","rel":"http://cfp.devoxx.be/api/profile/speaker","title":"Yara Senger"}],"id":"FBD-0753","title":"Architectures for IoT based on real projects: from Arduino in sailboats to complex Linux smart helmet!"}],"company":"Globalcode","bio":"Yara Senger has been a tireless Java activist in Brazil for many years. She is a Java Champion and Director of SouJava and she is an alternate representative of the group on the JCP Executive Committee. Yara has led SouJava in many initiatives, from technical events to social activities. She is co-founder and director of Globalcode, which trains developers throughout Brazil and The Developer's Conference besides several Hackathons and other events. In 2011, she was recipient of the Duke Choice's Award, for the JHome embedded environment. Yara is also an active speaker, giving presentations in many countries, including JavaOne SF, JavaOne Latin Ameria, JavaOne India, Devoxx, JFokus, and and get recognized as JavaOne Rockstar Speaker.","lastName":"Senger","firstName":"Yara","blog":"http://blog.globalcode.com.br/search/label/Yara","avatarURL":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTWPcIXYLim8kxAuahPbArOarKIGqkdPXOYEyWaDl2auT37Zb_LZd8NSA","twitter":"@yarasenger","lang":"fr"}