{"uuid":"9afeef80d74b514d8238c6c66df0e9e65c94a705","bioAsHtml":"<p>Michael Hoffer is a computer scientist working at the Goethe-Center for Scientific Computing in Frankfurt, Germany and co-founder of Digital Brain Factory. Hoffer is the developer of VRL-Studio, an innovative visual programming environment that combines visual and text-based programming. Currently he is doing his PhD at the Department of Computer Science and Mathematics at the University of Frankfurt, Germany. His research interests are developing visual programming concepts in the field of modeling and simulation of highly complex physical processes. Hoffer&#x27;s long-term goal is to create a visual general-purpose programming language based on the Java platform. Hoffer blogs about Java, JavaFX, and related technologies at http://mihosoft.eu.</p>\n","acceptedTalks":[{"talkType":"Quickie","track":"Future<Devoxx>","links":[{"href":"http://cfp.devoxx.be/api/conferences/DV15/talks/ASJ-0085","rel":"http://cfp.devoxx.be/api/profile/talk","title":"More details about this talk"},{"href":"http://cfp.devoxx.be/api/conferences/DV15/speakers/9afeef80d74b514d8238c6c66df0e9e65c94a705","rel":"http://cfp.devoxx.be/api/profile/speaker","title":"Michael Hoffer"}],"id":"ASJ-0085","title":"Algorithmic 3-D Modeling, Language Modeling and Visual Programming Using VRL-Studio (Part 1)"},{"talkType":"Quickie","track":"Future<Devoxx>","links":[{"href":"http://cfp.devoxx.be/api/conferences/DV15/talks/QXM-6507","rel":"http://cfp.devoxx.be/api/profile/talk","title":"More details about this talk"},{"href":"http://cfp.devoxx.be/api/conferences/DV15/speakers/9afeef80d74b514d8238c6c66df0e9e65c94a705","rel":"http://cfp.devoxx.be/api/profile/speaker","title":"Michael Hoffer"}],"id":"QXM-6507","title":"Algorithmic 3-D Modeling, Language Modeling and Visual Programming Using VRL-Studio (Part 2)"}],"company":"Goethe-Center for Scientific Computing","bio":"Michael Hoffer is a computer scientist working at the Goethe-Center for Scientific Computing in Frankfurt, Germany and co-founder of Digital Brain Factory. Hoffer is the developer of VRL-Studio, an innovative visual programming environment that combines visual and text-based programming. Currently he is doing his PhD at the Department of Computer Science and Mathematics at the University of Frankfurt, Germany. His research interests are developing visual programming concepts in the field of modeling and simulation of highly complex physical processes. Hoffer's long-term goal is to create a visual general-purpose programming language based on the Java platform. Hoffer blogs about Java, JavaFX, and related technologies at http://mihosoft.eu.","lastName":"Hoffer","firstName":"Michael","blog":"mihosoft.eu","avatarURL":"http://mihosoft.eu/wp-content/uploads/2014/10/admin-ajax.png","twitter":"@mihosoft","lang":"en"}