{"uuid":"e9c4efb57dec8f350fb79e15d02784dcda896a66","bioAsHtml":"<p>Akka hakker @ Typesafe, where he also participated in the Reactive Streams initiative and implemented it&#x27;s Technology Compatibility Kit. Konrad is a late-night passionate dev living by the motto &quot;Life is Study!&quot;. His favourite discussion topics range from distributed systems to capybaras. He has founded and run multiple user groups (Java, Scala, Computer Science, ...), and has is part of program committees of awesome conferences such as GeeCON and JavaOne SF. Other than that, he&#x27;s a frequent speaker on distributed systems and concurrency topics, at conferences all around the world. In those rare times he&#x27;s not coding, he spreads the joy of computer science, through helping local user groups and whitepaper reading clubs.</p>\n","acceptedTalks":[{"talkType":"Conference","track":"Java SE","links":[{"href":"http://cfp.devoxx.be/api/conferences/DV15/talks/ALS-4841","rel":"http://cfp.devoxx.be/api/profile/talk","title":"More details about this talk"},{"href":"http://cfp.devoxx.be/api/conferences/DV15/speakers/e9c4efb57dec8f350fb79e15d02784dcda896a66","rel":"http://cfp.devoxx.be/api/profile/speaker","title":"Konrad Malawski"}],"id":"ALS-4841","title":"Need for Async: In pursuit of internet-scale apps"}],"company":"hAkker @ Typesafe","bio":"Akka hakker @ Typesafe, where he also participated in the Reactive Streams initiative and implemented it's Technology Compatibility Kit. Konrad is a late-night passionate dev living by the motto \"Life is Study!\". His favourite discussion topics range from distributed systems to capybaras. He has founded and run multiple user groups (Java, Scala, Computer Science, ...), and has is part of program committees of awesome conferences such as GeeCON and JavaOne SF. Other than that, he's a frequent speaker on distributed systems and concurrency topics, at conferences all around the world. In those rare times he's not coding, he spreads the joy of computer science, through helping local user groups and whitepaper reading clubs.","lastName":"Malawski","firstName":"Konrad","blog":"http://www.project13.pl","avatarURL":"http://www.gravatar.com/avatar/015b04ffae636729e930cd27422df0b5","twitter":"@ktosopl","lang":"fr"}